app/controllers/keyboards_controller.rb

SELECT "keyboards".* FROM "keyboards"
---
  def index
    @keyboards = Keyboard.all

SELECT "keyboards".* FROM "keyboards" WHERE "keyboards"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "keys".* FROM "keys" WHERE "keys"."keyboard_id" = $1  [["keyboard_id", 5]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
---
  def show
    @keyboard = Keyboard.find(params[:id])
    @keys = Key.where(keyboard_id: @keyboard.id).all
    @owner = User.find(@keyboard.user_id)

INSERT INTO "keyboards" ("created_at", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 14 Mar 2014 16:01:29 UTC +00:00], ["name", "fdsfdsa"], ["updated_at", Fri, 14 Mar 2014 16:01:29 UTC +00:00], ["user_id", 1]]
---
  def create
    @keyboard = current_user.keyboards.new(keyboard_params)

    if @keyboard.save

SELECT "keyboards".* FROM "keyboards" WHERE "keyboards"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "keys".* FROM "keys" WHERE "keys"."keyboard_id" = 1
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @keyboard = Keyboard.find(params[:id])
    @keys = Key.where(keyboard_id: @keyboard.id).all
    @owner = User.find(@keyboard.user_id)

SELECT "keys".* FROM "keys" WHERE "keys"."keyboard_id" = 1
SELECT "keyboards".* FROM "keyboards" WHERE "keyboards"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def update
    @key = Key.find(params[:key_id])
    @keyboard = Keyboard.find(params[:keyboard_id])
    @owner = User.find(@keyboard.user_id)