app/controllers/keys_controller.rb

  def new
  	@keyboard = Keyboard.find(params[:keyboard_id])
    @owner = User.find(@keyboard.user_id)
---
SELECT "keyboards".* FROM "keyboards" WHERE "keyboards"."id" = $1 LIMIT 1  [["id", "4"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1

  def create
    @keyboard = Keyboard.find(params[:keyboard_id])
    @key = @keyboard.keys.new(key_params)



    if @key.save
---
SELECT "keyboards".* FROM "keyboards" WHERE "keyboards"."id" = $1 LIMIT 1  [["id", "4"]]
INSERT INTO "keys" ("created_at", "delay", "frequency", "key_code", "keyboard_id", "note_filter", "panner", "updated_at", "volume", "wave") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"